app/views/posts/_form.html.haml

SELECT "categories".* FROM "categories"
---
      Select category for the post
      =f.select :category_id, Category.all.map {|cat| [cat.category_name, cat.id] }, include_blank: true, class: 'form-control'