app/controllers/comments_controller.rb

  def create
    @comment = @post.comments.new(comments_params)
    @comment.user_id = current_user.id
    if @comment.save
---
INSERT INTO "comments" ("user_id", "post_id", "content", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 1], ["post_id", 4], ["content", "asdadas"], ["created_at", "2018-06-18 07:30:52.469768"], ["updated_at", "2018-06-18 07:30:52.469768"]]

  def update
    if @comment.update_attributes(comments_params)
---
UPDATE "comments" SET "content" = $1, "updated_at" = $2 WHERE "comments"."id" = $3  [["content", "asdsaddas1s"], ["updated_at", "2018-06-30 17:06:45.395444"], ["id", 1]]

  def destroy
   if @comment.destroy
---
DELETE FROM "comments" WHERE "comments"."id" = $1  [["id", 7]]

  def find_post
    @post = Post.find(params[:post_id])
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]

  def find_comment
    @comment = @post.comment.find(params[:id])
---
SELECT  "comments".* FROM "comments" WHERE "comments"."post_id" = $1 AND "comments"."id" = $2 LIMIT $3  [["post_id", 3], ["id", 7], ["LIMIT", 1]]