app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts" ORDER BY "posts"."created_at" DESC
---
  def index
    @posts = Post.all

INSERT INTO "posts" ("user_id", "title", "content", "created_at", "updated_at", "slug", "short_body") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["user_id", 1], ["title", "sadasd"], ["content", "asdasd"], ["created_at", "2018-06-30 08:45:38.992809"], ["updated_at", "2018-06-30 08:45:38.992809"], ["slug", "sadasd"], ["short_body", "sadasd"]]
---
  def create
    @post = current_user.posts.new(post_params)
    if @post.save

UPDATE "posts" SET "image" = $1, "updated_at" = $2 WHERE "posts"."id" = $3  [["image", "something.jpg"], ["updated_at", "2018-07-04 20:02:21.437340"], ["id", 1]]
---
    def update
      if @post.update_attributes(post_params)

SELECT  "comments".* FROM "comments" WHERE "comments"."post_id" = $1 ORDER BY created_at desc LIMIT $2 OFFSET $3  [["post_id", 1], ["LIMIT", 3], ["OFFSET", 0]]
SELECT COUNT(*) FROM "comments" WHERE "comments"."post_id" = $1  [["post_id", 1]]
---
    def show
      @comments = @post.comments.all.page params[:page]

DELETE FROM "posts" WHERE "posts"."id" = $1  [["id", 1]]
---
    def destroy
      if @post.destroy

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 ORDER BY "posts"."created_at" DESC LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
    def add_to_favorite
      @post = Post.friendly.find(params[:post_id])

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
---
    def find_post
      @post = Post.friendly.find(params[:id])